# PROGETTO DI FOUNDATIONS OF COMPUTER SCIENCE

### Davide Garavaldi matr.818308

In [1]:
import numpy as np
import pandas as pd
import datetime as dt

## Ex.1
Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender.

In [2]:
loans_lenders=pd.read_csv('F:/Davide/Fondamenti Computer Science/Progetto/loans_lenders.csv')
loans_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

In [3]:
loans_lenders.shape

(1387432, 2)

In [4]:
#con assign() viene restituito un nuovo dataset con le stesse colonne di quello di partenza ma con lenders cambiato 
#con explode() ogni elemento della lista ottenuta viene trasformato in una riga. 

loans_lenders_norm = loans_lenders.assign(lenders=loans_lenders.lenders.str.split(',')).explode('lenders').reset_index(drop=True)

#visto che gli indici vengono replicati li resetto
loans_lenders_norm.head()

   loan_id       lenders
0   483693        muc888
1   483693       sam4326
2   483693   camaran3922
3   483693   lachheb1865
4   483693   rebecca3499

## Ex. 2

For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.

In [5]:
loans = pd.read_csv('F:/Davide/Fondamenti Computer Science/Progetto/loans.csv',parse_dates=["disburse_time", "planned_expiration_time"]) 
loans.head()
#parse_dates parametro per eseguire il parsing sulle date

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

In [6]:
# con datetime converto l'oggetto nel formato data yyyy/mm/dd 
loans['disburse_date'] = pd.to_datetime(loans['disburse_time'].dt.date) 
loans['planned_expiration_date'] = pd.to_datetime(loans['planned_expiration_time'].dt.date)

In [7]:
#calcolo la differenza di tempo richiesta
loans['durata'] = loans['planned_expiration_date']-loans['disburse_date']
loans_diff = loans[['loan_id','planned_expiration_date','disburse_date','durata']]
loans_diff.head()

   loan_id planned_expiration_date disburse_date  durata
0   657307              2014-02-14    2013-12-22 54 days
1   657259              2014-03-26    2013-12-20 96 days
2   658010              2014-02-15    2014-01-09 37 days
3   659347              2014-02-21    2014-01-17 35 days
4   656933              2014-02-13    2013-12-17 58 days

In [8]:
#controllo per vedere quali date mancano
loans_diff[loans_diff.durata.isnull()].head()

    loan_id planned_expiration_date disburse_date durata
64   251406                     NaT    2010-11-18    NaT
65   252537                     NaT    2010-11-25    NaT
66   253044                     NaT    2010-11-25    NaT
67   254012                     NaT    2010-11-16    NaT
69   251336                     NaT    2010-11-10    NaT

## Ex.3

Find the lenders that have funded at least twice.

In [9]:
#il numero dei lender viene contato con count() e si filtrano i lenders per numero > 2
lenders_fin=loans_lenders_norm.groupby('lenders').count()
lenders_fin=lenders_fin.reset_index()
lenders_fin.columns=["lenders","number"]
lenders_fin[lenders_fin["number"]>=2].head()

           lenders  number
0              000      39
1            00000      39
2             0002      70
4   0101craign0101      71
5          0132575       4

In [10]:
lenders_fin[lenders_fin["number"]>=2].shape
# i lenders che hano effettuato un prestito sono 1005111

(1005111, 2)

## Ex.4

For each country, count how many loans have involved that country as borrowers.

In [11]:
#raggruppo per country e conto il numero di loan_id
borrowers=loans[['loan_id','country_name']].groupby('country_name').count()
borrowers_country=borrowers.reset_index()
borrowers_country.columns=[["country","number"]]
borrowers_country.head()

       country number
0  Afghanistan   2337
1      Albania   3075
2      Armenia  13952
3   Azerbaijan  10172
4       Belize    218

In [12]:
borrowers.loc[borrowers['loan_id'].idxmin()]
#Stato col minor numero di mutuatari

loan_id    1
Name: Botswana, dtype: int64

In [13]:
borrowers.loc[borrowers['loan_id'].idxmax()]
#Stato col maggior numero di mutuatari

loan_id    285336
Name: Philippines, dtype: int64

## Ex.5

For each country, compute the overall amount of money borrowed.

In [22]:
country_borrow = loans[['loan_id', 'country_code', 'loan_amount']]

In [23]:
#raggruppo per country_code e calcolo la somma del denaro preso in prestito
money_borrowed_country= country_borrow.groupby('country_code').sum()['loan_amount']
money_borrowed_country = money_borrowed_country.rename_axis('country_code').reset_index(name = 'money_borrowed')
money_borrowed_country.head()

  country_code  money_borrowed
0           AF       1967950.0
1           AL       4307350.0
2           AM      22950475.0
3           AZ      14784625.0
4           BA        477250.0

In [24]:
money_borrowed_country.loc[money_borrowed_country['money_borrowed'].idxmin()]
#Stato con il minor numero di denaro preso in prestito

country_code        GZ
money_borrowed    5000
Name: 30, dtype: object

In [25]:
money_borrowed_country.loc[money_borrowed_country['money_borrowed'].idxmax()]
#Stato con il maggior numero di denaro preso in prestito

country_code               PH
money_borrowed    9.79846e+07
Name: 61, dtype: object

## Ex.6

Like the previous point but express as a percentage of the overall amount lent.

In [26]:
#calcolo il totale del denaro preso in prestito
tot_amount = money_borrowed_country['money_borrowed'].sum()

In [27]:
#calcolo la percentuale di denaro preso in prestito per Stato
money_borrowed_country['perc'] = (money_borrowed_country['money_borrowed'] / tot_amount) * 100
money_borrowed_country.head()

  country_code  money_borrowed      perc
0           AF       1967950.0  0.166578
1           AL       4307350.0  0.364598
2           AM      22950475.0  1.942654
3           AZ      14784625.0  1.251452
4           BA        477250.0  0.040397

## Ex.7

Like the three previous points, but split for each year (with respect to disburse time).

In [28]:
#diminuisco la dimensione del dataset iniziale
country_year = loans[['loan_id','country_name', 'loan_amount', 'disburse_time']]

In [29]:
#estraggo l'anno da disburse_time
pd.set_option('mode.chained_assignment', None)
country_year['year'] = country_year['disburse_time'].dt.year
country_year.head()

   loan_id country_name  loan_amount             disburse_time    year
0   657307  Philippines        125.0 2013-12-22 08:00:00+00:00  2013.0
1   657259     Honduras        400.0 2013-12-20 08:00:00+00:00  2013.0
2   658010     Pakistan        400.0 2014-01-09 08:00:00+00:00  2014.0
3   659347   Kyrgyzstan        625.0 2014-01-17 08:00:00+00:00  2014.0
4   656933  Philippines        425.0 2013-12-17 08:00:00+00:00  2013.0

In [30]:
#per eseguire i 3 punti precedenti ora raggruppo congiuntamente per country_name e year
country_year.groupby(['country_name','year']).count()['loan_id']

country_name  year
Afghanistan   2007.0     408
              2008.0     370
              2009.0     678
              2010.0     632
              2011.0     247
                        ...
Zimbabwe      2013.0     426
              2014.0    2078
              2015.0     600
              2016.0     808
              2017.0    1079
Name: loan_id, Length: 748, dtype: int64

In [31]:
country_year.groupby(['country_name','year']).sum()['loan_amount']

country_name  year
Afghanistan   2007.0     194975.0
              2008.0     365375.0
              2009.0     585125.0
              2010.0     563350.0
              2011.0     245125.0
                          ...
Zimbabwe      2013.0     678525.0
              2014.0    1311575.0
              2015.0     723625.0
              2016.0     788600.0
              2017.0    1237600.0
Name: loan_amount, Length: 748, dtype: float64

In [32]:
country_year.groupby(['country_name','year']).sum()['loan_amount']/country_year['loan_amount'].sum()*100

country_name  year
Afghanistan   2007.0    0.016503
              2008.0    0.030926
              2009.0    0.049527
              2010.0    0.047683
              2011.0    0.020748
                          ...
Zimbabwe      2013.0    0.057432
              2014.0    0.111015
              2015.0    0.061250
              2016.0    0.066749
              2017.0    0.104754
Name: loan_amount, Length: 748, dtype: float64

## Ex.8

For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount

In [33]:
#usando la tabella loans_lenders_norm posso contare quanti lenders ci sono per ogni prestito
lenders_per_loan = loans_lenders_norm['loan_id'].value_counts() 
lenders_per_loan = lenders_per_loan.rename_axis('loan_id').reset_index(name = 'number_of_lenders')
lenders_per_loan.head()

   loan_id  number_of_lenders
0  1433600               2888
1  1396525               2828
2   722883               2674
3  1398161               2619
4  1359159               2344

In [34]:
#creo un dataset contenente l'id del prestito, i lenders e l'ammontare di denaro del prestito
parz1 = pd.merge(loans_lenders_norm, loans[['loan_id','loan_amount']], on = 'loan_id')

In [35]:
#aggiungo al dataset precedente il numero di lenders che fanno parte di ogni prestito
parz2 = pd.merge(parz1, lenders_per_loan, on = 'loan_id')

In [36]:
#per ogni prestito calcolo la frazione di denaro che ogni lender 
parz2['frazione_per_prestito'] = parz2['loan_amount'] / parz2['number_of_lenders']
parz2.head()

,loan_id,lenders,loan_amount,number_of_lenders,frazione_per_prestito
0,483693,muc888,1225.0,40,30.625
1,483693,sam4326,1225.0,40,30.625
2,483693,camaran3922,1225.0,40,30.625
3,483693,lachheb1865,1225.0,40,30.625
4,483693,rebecca3499,1225.0,40,30.625

In [37]:
#raggruppo per lender e calcolo la somma totale prestata da ogni lender
ammontare_tot_per_lender = pd.DataFrame(parz2.groupby('lenders').sum()['frazione_per_prestito'])
ammontare_tot_per_lender=ammontare_tot_per_lender.reset_index()
ammontare_tot_per_lender.columns=[["lenders","tot_amount"]]
ammontare_tot_per_lender.head()

           lenders   tot_amount
0              000  1672.618411
1            00000  1380.693644
2             0002  2472.563566
3         00mike00    52.631579
4   0101craign0101  2623.565117

## Ex.9

For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [38]:
lenders =  pd.read_csv('F:/Davide/Fondamenti Computer Science/Progetto/lenders.csv')
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

In [39]:
nationality_lenders = lenders[['permanent_name','country_code']]
nationality_lenders.head()
#alcuni lender hanno valori mancanti sulla nazionalità

   permanent_name country_code
0        qian3013          NaN
1       reena6733          NaN
2         mai5982          NaN
3  andrew86079135          NaN
4      nguyen6962          NaN

In [40]:
#per poter sostituire i valori mancanti prima calcolo la distribuzione delle nazionalità sui dati noti
nationality_distrib = nationality_lenders['country_code'].value_counts()
nationality_distrib = nationality_distrib.rename_axis('country_code').reset_index(name = 'count')
nationality_distrib.head()

  country_code   count
0           US  591612
1           CA   67970
2           GB   38380
3           AU   37103
4           DE   16007

In [41]:
#calcolo la percentuale di ogni nazionalità sul numero totale di persone 
tot = nationality_distrib['count'].sum()
nationality_distrib['perc'] = (nationality_distrib['count'] / tot) * 100

In [42]:
#Trasformo la variabile in modo che i valori sommino a 1
nationality_distrib['perc'] /= nationality_distrib['perc'].sum()
nationality_distrib.head()

  country_code   count      perc
0           US  591612  0.664330
1           CA   67970  0.076325
2           GB   38380  0.043097
3           AU   37103  0.041664
4           DE   16007  0.017975

In [43]:
#estraggo i lenders di cui non si conosce la nazionalità
nationality_da_completare = nationality_lenders.loc[nationality_lenders['country_code'].isnull()]
nationality_da_completare

         permanent_name country_code
0              qian3013          NaN
1             reena6733          NaN
2               mai5982          NaN
3        andrew86079135          NaN
4            nguyen6962          NaN
...                 ...          ...
2349167        todd5695          NaN
2349168    kate40761039          NaN
2349169       janet7309          NaN
2349170          pj4198          NaN
2349172      simone9846          NaN

[1458635 rows x 2 columns]

In [44]:
#imputo casualmente le nazionalità sulla base della distribuzione ottenuta coi dati noti 
np.random.seed(1234)
nationality_da_completare['country_code'] = np.random.choice(nationality_distrib['country_code'], 
                                                             size = len(nationality_da_completare.index), 
                                                             p = nationality_distrib['perc'])
nationality_da_completare.head() #ora ogni lender ha la propria nazionalità

   permanent_name country_code
0        qian3013           US
1       reena6733           US
2         mai5982           US
3  andrew86079135           AU
4      nguyen6962           GB

In [45]:
#aggiorno lenders_nationality con le nuove nazionalità
nationality_lenders.update(nationality_da_completare)
nationality_lenders = nationality_lenders.rename(columns = {'permanent_name':'lenders'})
nationality_lenders.head()

          lenders country_code
0        qian3013           US
1       reena6733           US
2         mai5982           US
3  andrew86079135           AU
4      nguyen6962           GB

In [46]:
#con merge unisco i dataset per ottenere le informazioni che mi servono
df_parz = pd.merge(loans_lenders_norm, nationality_lenders, on = 'lenders')

In [47]:
df_9 = pd.merge(df_parz, country_borrow, on = 'loan_id') # money_borrowed_country è il risltato del punto 5
df_9 = df_9.rename(columns = {'country_code_x':'lender_country', 'country_code_y':'borrower_country'})
df_9.head()

   loan_id lenders lender_country borrower_country  loan_amount
0   483693  muc888             US               PH       1225.0
1   483738  muc888             US               PH        500.0
2   485000  muc888             US               PH        725.0
3   486087  muc888             US               PH        400.0
4   534428  muc888             US               PH        625.0

In [48]:
#calcolo la somma totale prestata da ogni stato
country_lender = df_9.groupby('lender_country').sum()['loan_amount']

In [49]:
#unisco il dataset precedente con quello ottenuto al punto 5 per avere il denaro preso in prestito
bilancio = pd.merge(money_borrowed_country, country_lender, left_on=['country_code'], right_on=['lender_country'])

In [50]:
bilancio['difference'] = bilancio['loan_amount'] - bilancio['money_borrowed']
bilancio.head()
#il valore negativo indica che il denaro preso in prestito è di più di quanto ne abbiano prestato

  country_code  money_borrowed      perc  loan_amount  difference
0           AF       1967950.0  0.166578     170800.0  -1797150.0
1           AL       4307350.0  0.364598      33850.0  -4273500.0
2           AM      22950475.0  1.942654      30475.0 -22920000.0
3           AZ      14784625.0  1.251452      11925.0 -14772700.0
4           BA        477250.0  0.040397      93075.0   -384175.0

## Ex.10

Which country has the highest ratio between the difference computed at the previous point and the population?

In [51]:
country_stat =  pd.read_csv('F:/Davide/Fondamenti Computer Science/Progetto/country_stats.csv')
country_stat.head()

,country_name,country_code,country_code3,continent,region,population,population_below_poverty_line,hdi,life_expectancy,expected_years_of_schooling,mean_years_of_schooling,gni,kiva_country_name
0,India,IN,IND,Asia,Southern Asia,1339180127,21.9,0.623559,68.322,11.696590,6.298834,5663.474799,India
1,Nigeria,NG,NGA,Africa,Western Africa,190886311,70.0,0.527105,53.057,9.970482,6.000000,5442.901264,Nigeria
2,Mexico,MX,MEX,Americas,Central America,129163276,46.2,0.761683,76.972,13.299090,8.554985,16383.106680,Mexico
3,Pakistan,PK,PAK,Asia,Southern Asia,197015955,29.5,0.550354,66.365,8.106910,5.089460,5031.173074,Pakistan
4,Bangladesh,BD,BGD,Asia,Southern Asia,164669751,31.5,0.578824,71.985,10.178706,5.241577,3341.490722,Bangladesh

In [52]:
#diminuisco la dimensione del dataset e tengo solo le variabili di interesse
country_stat_parz= country_stat[['country_code','country_name','population','population_below_poverty_line']]

In [53]:
#unisco i dataset di interesse per l'esercizio
ratio = pd.merge(country_stat_parz, bilancio[['country_code','difference']], on = 'country_code')

In [54]:
#uso il valore assoluto perchè non so cosa sintenda per valore più alto in positivo o in negativo
ratio['rapporto_10'] = abs(ratio['difference'] / ratio['population'])

In [55]:
#estraggo lo stato col valore massimo
ratio.iloc[ratio['rapporto_10'].idxmax()]

country_code                              WS
country_name                           Samoa
population                            196440
population_below_poverty_line            NaN
difference                      -1.22114e+07
rapporto_10                          62.1633
Name: 84, dtype: object

## Ex.11

Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

In [56]:
#calcolo la popolazione che non sta sotto la linea di povertà per ogni Stato
population_not_below_poverty_line = ratio['population'] * (1 - (ratio['population_below_poverty_line'] / 100))

In [57]:
ratio['rapporto_11'] = abs(ratio['difference'] / population_not_below_poverty_line)
#rapporto calcolato come nel caso precedente

In [58]:
#estraggo lo stato col valore massimo
ratio.iloc[ratio['rapporto_11'].idxmax()]

country_code                            AM
country_name                       Armenia
population                         2930450
population_below_poverty_line           32
difference                      -2.292e+07
rapporto_10                        7.82132
rapporto_11                        11.5019
Name: 69, dtype: object

## Ex.12

For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD 31 / (31+365+30) = 363.85 for 2016, 5000USD 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.

In [59]:
#elimino i valori mancanti da inizio e fine prestito
loans=loans.dropna(subset=['planned_expiration_time'])
loans=loans.dropna(subset=['disburse_time'])
loans=loans.reset_index(drop=True )
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,disburse_date,planned_expiration_date,durata
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2,1,NaN,female,true,irregular,field_partner,2013-12-22,2014-02-14,54 days
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2,1,NaN,female,true,monthly,field_partner,2013-12-20,2014-03-26,96 days
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,2014-01-09,2014-02-15,37 days
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2,1,user_favorite,female,true,monthly,field_partner,2014-01-17,2014-02-21,35 days
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,2013-12-17,2014-02-13,58 days

In [60]:
#inizio prestito piu vecchio
loans.iloc[loans['disburse_time'].idxmin()]

loan_id                                                                       358219
loan_name                                                                 Mirismayil
original_language                                                            English
description                        Mirismayil is a 28-year-old trader who sells d...
description_translated                                                           NaN
funded_amount                                                                   2300
loan_amount                                                                     2300
status                                                                        funded
activity_name                                                         Clothing Sales
sector_name                                                                 Clothing
loan_use                                                    to purchase more clothes
country_code                                                                      AZ
country_name                                                              Azerbaijan
town_name                                                                       Agsu
currency_policy                                                           not shared
currency_exchange_coverage_rate                                                  NaN
currency                                                                         AZN
partner_id                                                                        56
posted_time                                            2011-11-15 12:41:54.000 +0000
planned_expiration_time                                    2012-02-11 22:50:58+00:00
disburse_time                                              2011-10-18 07:00:00+00:00
raised_time                                            2012-02-01 05:15:58.000 +0000
lender_term                                                                       17
num_lenders_total                                                                 78
num_journal_entries                                                                1
num_bulk_entries                                                                   1
tags                                                                             NaN
borrower_genders                                                                male
borrower_pictured                                                               true
repayment_interval                                                           monthly
distribution_model                                                     field_partner
disburse_date                                                    2011-10-18 00:00:00
planned_expiration_date                                          2012-02-11 00:00:00
durata                                                             116 days 00:00:00
Name: 851626, dtype: object

In [61]:
#fine prestito piu recente
loans.iloc[loans['planned_expiration_time'].idxmax()]

loan_id                                                                      1444085
loan_name                                                                        NaN
original_language                                                            English
description                        To pay for feed and a hutch for the turduckens...
description_translated             To pay for feed and a hutch for the turduckens...
funded_amount                                                                      0
loan_amount                                                                       25
status                                                                   fundRaising
activity_name                                                              Livestock
sector_name                                                              Agriculture
loan_use                           to start a turducken farm. - this loan use has...
country_code                                                                      KE
country_name                                                                   Kenya
town_name                                                                        NaN
currency_policy                                                               shared
currency_exchange_coverage_rate                                                  0.1
currency                                                                         KES
partner_id                                                                       138
posted_time                                            2018-01-11 07:11:23.000 +0000
planned_expiration_time                                    2018-02-10 07:35:04+00:00
disburse_time                                              2018-01-10 08:00:00+00:00
raised_time                                                                      NaN
lender_term                                                                       13
num_lenders_total                                                                  0
num_journal_entries                                                                1
num_bulk_entries                                                                   1
tags                                                                             NaN
borrower_genders                                                              female
borrower_pictured                                                               true
repayment_interval                                                           monthly
distribution_model                                                     field_partner
disburse_date                                                    2018-01-10 00:00:00
planned_expiration_date                                          2018-02-10 00:00:00
durata                                                              31 days 00:00:00
Name: 180901, dtype: object

In [62]:
#calcolo l'ammontare giornaliero prendendo la durata dal punto 2
loans['daily']= loans['loan_amount']/loans['durata'].dt.days
loans['daily']

0           2.314815
1           4.166667
2          10.810811
3          17.857143
4           7.327586
             ...
1044957    10.000000
1044958     7.692308
1044959    47.549020
1044960     1.587302
1044961     2.868852
Name: daily, Length: 1044962, dtype: float64

In [63]:
risultato={}
for anno in range(2011, 2019): #per ogni anno nel range dei prestiti
    selection=loans[(loans['disburse_time'].dt.year<=anno) & (loans['planned_expiration_time'].dt.year>=anno)]
    risultato[anno]=0 #selezioni i prestiti in corso in quell anno
    for row in selection.index:
        if selection.at[row, 'disburse_time'].year < anno: #iniziato prima
            if selection.at[row, 'planned_expiration_time'].year == anno: #finisce nell anno
                risultato[anno]+= selection.at[row, 'planned_expiration_time'].dayofyear* selection.at[row, 'daily']
            if selection.at[row, 'planned_expiration_time'].year > anno: #non finisce in quell anno
                if (anno == 2012 | anno == 2016):
                    risultato[anno]+= 366* selection.at[row, 'daily']
                else:
                    risultato[anno]+= 365* selection.at[row, 'daily']
        if selection.at[row, 'disburse_time'].year == anno: #iniziato in quell anno
            if selection.at[row, 'planned_expiration_time'].year == anno: #finisce nell anno
                risultato[anno]+= selection.at[row, 'loan_amount']
            if selection.at[row, 'planned_expiration_time'].year > anno: #non finisce in quell anno
                if (anno == 2012 | anno == 2016):
                    risultato[anno]+= (366-selection.at[row, 'disburse_time'].dayofyear) * selection.at[row, 'daily']
                else:
                    risultato[anno]+= (365-selection.at[row, 'disburse_time'].dayofyear) * selection.at[row, 'daily']

In [64]:
risultato

{2011: 629911.7748786244,
 2012: 112980395.41302112,
 2013: 124937116.54208797,
 2014: 153151069.54506147,
 2015: 159759910.81277788,
 2016: 158537213.96406466,
 2017: 171861891.63272125,
 2018: 5705070.769987256}